arendst/Tasmota/tasmota/tasmota_xdrv_driver/xdrv_07_esp32_domoticz.ino
/*
  xdrv_07_esp32_domoticz.ino - domoticz support for Tasmota

  Copyright (C) 2025  Theo Arends

  This program is free software: you can redistribute it and/or modify
  it under the terms of the GNU General Public License as published by
  the Free Software Foundation, either version 3 of the License, or
  (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program.  If not, see <http://www.gnu.org/licenses/>.
*/

#ifdef ESP32
#ifdef USE_DOMOTICZ
/*********************************************************************************************\
 * Domoticz support with all relays/buttons/switches using more RAM and Settings from filesystem
 *
 * Adds commands:
 * DzIdx<number> <idx>      - Set power number to Domoticz Idx allowing Domoticz to control Tasmota power
 * DzKeyIdx<number> <idx>   - Set button number to Domoticz Idx allowing Tasmota button as input to Domoticz
 * DzSwitchId<number> <idx> - Set switch number to Domoticz Idx allowing Tasmota switch as input to Domoticz
 * DzSensorIdx<type> <idx>  - Set sensor type to Domoticz Idx
 * DzUpdateTimer 0          - Send power state at teleperiod to Domoticz (default)
 * DzUpdateTimer <seconds>  - Send power state at <seconds> interval to Domoticz
 * DzSend1 <idx>,<values>   - {\"idx\":<idx>,\"nvalue\":0,\"svalue\":\"<values>\",\"Battery\":xx,\"RSSI\":yy}
 *   Example: rule1 on power1#state do dzsend1 9001,%value% endon
 * DzSend1 418,%var1%;%var2% or DzSend1 418,%var1%:%var2% - Notice colon as substitute to semi-colon
 * DzSend2 <idx>,<values>   - USE_SHUTTER only - {\"idx\":<idx>,\"nvalue\":<position>,\"svalue\":\"<values>\",\"Battery\":xx,\"RSSI\":yy}
 * DzSend3 <idx>,<values>   - {\"idx\":<idx>,\"nvalue\":<values>,\"Battery\":xx,\"RSSI\":yy}
 * DzSend4 <idx>,<state>    - {\"command\":\"switchlight\",\"idx\":<idx>,\"switchcmd\":\"<state>\"}
 * DzSend5 <idx>,<state>    - {\"command\":\"switchscene\",\"idx\":<idx>,\"switchcmd\":\"<state>\"}
\*********************************************************************************************/

#define XDRV_07             7

//#define USE_DOMOTICZ_DEBUG    // Enable additional debug logging

#define D_PRFX_DOMOTICZ "Dz"
#define D_CMND_IDX "Idx"
#define D_CMND_KEYIDX "KeyIdx"
#define D_CMND_SWITCHIDX "SwitchIdx"
#define D_CMND_SENSORIDX "SensorIdx"
#define D_CMND_UPDATETIMER "UpdateTimer"
#define D_CMND_DZSEND "Send"

const char kDomoticzCommands[] PROGMEM = D_PRFX_DOMOTICZ "|"  // Prefix
  D_CMND_IDX "|" D_CMND_KEYIDX "|" D_CMND_SWITCHIDX "|" D_CMND_SENSORIDX "|" D_CMND_UPDATETIMER "|" D_CMND_DZSEND ;

void (* const DomoticzCommand[])(void) PROGMEM = {
  &CmndDomoticzIdx, &CmndDomoticzKeyIdx, &CmndDomoticzSwitchIdx, &CmndDomoticzSensorIdx, &CmndDomoticzUpdateTimer, &CmndDomoticzSend };

const char DOMOTICZ_MESSAGE[] PROGMEM = "{\"idx\":%d,\"nvalue\":%d,\"svalue\":\"%s\",\"Battery\":%d,\"RSSI\":%d}";

const char kDomoticzSensors[] PROGMEM =  // Relates to enum DomoticzSensors
  D_DOMOTICZ_TEMP "|" D_DOMOTICZ_TEMP_HUM "|" D_DOMOTICZ_TEMP_HUM_BARO "|" D_DOMOTICZ_POWER_ENERGY "|" D_DOMOTICZ_ILLUMINANCE "|"
  D_DOMOTICZ_COUNT "|" D_DOMOTICZ_VOLTAGE "|" D_DOMOTICZ_CURRENT "|" D_DOMOTICZ_AIRQUALITY "|" D_DOMOTICZ_P1_SMART_METER "|" D_DOMOTICZ_SHUTTER ;

const char kDomoticzCommand[] PROGMEM = "switchlight|switchscene";

char domoticz_in_topic[] = DOMOTICZ_IN_TOPIC;

typedef struct DzSettings_t {
  uint32_t crc32;                       // To detect file changes
  uint32_t update_timer;
  uint32_t relay_idx[MAX_RELAYS_SET];
  uint32_t key_idx[MAX_RELAYS_SET];     // = MAX_KEYS_SET
  uint32_t switch_idx[MAX_RELAYS_SET];  // = MAX_SWITCHES_SET
  uint32_t sensor_idx[DZ_MAX_SENSORS];
} DzSettings_t;

typedef struct Domoticz_t {
  DzSettings_t Settings;                // Persistent settings
  int update_timer;
  bool subscribe;
  bool update_flag;
#ifdef USE_SHUTTER
  bool is_shutter;
#endif // USE_SHUTTER
} Domoticz_t;
Domoticz_t* Domoticz;

/*********************************************************************************************\
 * Driver Settings load and save
\*********************************************************************************************/

#ifdef USE_UFILESYS
#define XDRV_07_KEY           "drvset03"

bool DomoticzLoadData(void) {
  char key[] = XDRV_07_KEY;
  String json = UfsJsonSettingsRead(key);
  if (json.length() == 0) { return false; }

  // {"Crc":1882268982,"Update":0,"Relay":[1,2,3,4],"Key":[5,6,7,8],"Switch":[9,10,11,12],"Sensor":[13,14]}
  JsonParser parser((char*)json.c_str());
  JsonParserObject root = parser.getRootObject();
  if (!root) { return false; }

  Domoticz->Settings.crc32 = root.getUInt(PSTR("Crc"), Domoticz->Settings.crc32);
  Domoticz->Settings.update_timer = root.getUInt(PSTR("Update"), Domoticz->Settings.update_timer);
  JsonParserArray arr = root[PSTR("Relay")];
  if (arr) {
    for (uint32_t i = 0; i < MAX_RELAYS_SET; i++) {
      if (arr[i]) { Domoticz->Settings.relay_idx[i] = arr[i].getUInt(); }
    }
  }
  arr = root[PSTR("Key")];
  if (arr) {
    for (uint32_t i = 0; i < MAX_RELAYS_SET; i++) {
      if (arr[i]) { Domoticz->Settings.key_idx[i] = arr[i].getUInt(); }
    }
  }
  arr = root[PSTR("Switch")];
  if (arr) {
    for (uint32_t i = 0; i < MAX_RELAYS_SET; i++) {
      if (arr[i]) { Domoticz->Settings.switch_idx[i] = arr[i].getUInt(); }
    }
  }
  arr = root[PSTR("Sensor")];
  if (arr) {
    for (uint32_t i = 0; i < DZ_MAX_SENSORS; i++) {
      if (arr[i]) { Domoticz->Settings.sensor_idx[i] = arr[i].getUInt(); }
    }
  }
  return true;
}

bool DomoticzSaveData(void) {
  Response_P(PSTR("{\"" XDRV_07_KEY "\":{"
                   "\"Crc\":%u,"
                   "\"Update\":%u"),
                   Domoticz->Settings.crc32,
                   Domoticz->Settings.update_timer);
  ResponseAppend_P(PSTR(",\"Relay\":"));
  for (uint32_t i = 0; i < MAX_RELAYS_SET; i++) {
    ResponseAppend_P(PSTR("%c%d"), (0==i)?'[':',', Domoticz->Settings.relay_idx[i]);
  }
  ResponseAppend_P(PSTR("],\"Key\":"));
  for (uint32_t i = 0; i < MAX_RELAYS_SET; i++) {
    ResponseAppend_P(PSTR("%c%d"), (0==i)?'[':',', Domoticz->Settings.key_idx[i]);
  }
  ResponseAppend_P(PSTR("],\"Switch\":"));
  for (uint32_t i = 0; i < MAX_RELAYS_SET; i++) {
    ResponseAppend_P(PSTR("%c%d"), (0==i)?'[':',', Domoticz->Settings.switch_idx[i]);
  }
  ResponseAppend_P(PSTR("],\"Sensor\":"));
  for (uint32_t i = 0; i < DZ_MAX_SENSORS; i++) {
    ResponseAppend_P(PSTR("%c%d"), (0==i)?'[':',', Domoticz->Settings.sensor_idx[i]);
  }
  ResponseAppend_P(PSTR("]}}"));

  if (!UfsJsonSettingsWrite(ResponseData())) {
    return false;
  }
  return true;
}

