arendst/Tasmota/tasmota/tasmota_xdrv_driver/xdrv_07_esp32_domoticz.ino
void DomoticzDeleteData(void) {
  char key[] = XDRV_07_KEY;
  UfsJsonSettingsDelete(key);  // Use defaults
}
#endif  // USE_UFILESYS

/*********************************************************************************************/

void DomoticzSettingsLoad(bool erase) {
  // Called from FUNC_PRE_INIT (erase = 0) once at restart
  // Called from FUNC_RESET_SETTINGS (erase = 1) after command reset 4, 5, or 6
  memset(&Domoticz->Settings, 0x00, sizeof(DzSettings_t));

#ifndef CONFIG_IDF_TARGET_ESP32P4
  // Init any other parameter in struct DzSettings
  Domoticz->Settings.update_timer = Settings->domoticz_update_timer;
  for (uint32_t i = 0; i < MAX_DOMOTICZ_IDX; i++) {
    Domoticz->Settings.relay_idx[i] = Settings->domoticz_relay_idx[i];
    Domoticz->Settings.key_idx[i] = Settings->domoticz_key_idx[i];
    Domoticz->Settings.switch_idx[i] = Settings->domoticz_switch_idx[i];
  }
  uint32_t max_sns_idx = MAX_DOMOTICZ_SNS_IDX;
  if (max_sns_idx > DZ_MAX_SENSORS) {
    max_sns_idx = DZ_MAX_SENSORS;
  }
  for (uint32_t i = 0; i < max_sns_idx; i++) {
    Domoticz->Settings.sensor_idx[i] = Settings->domoticz_sensor_idx[i];
  }
  // *** End Init default values ***
#endif  // CONFIG_IDF_TARGET_ESP32P4

#ifndef USE_UFILESYS
  AddLog(LOG_LEVEL_DEBUG, PSTR("CFG: Domoticz use defaults as file system not enabled"));
#else
  // Try to load key
  if (erase) {
    DomoticzDeleteData();
  }
  else if (DomoticzLoadData()) {
    AddLog(LOG_LEVEL_DEBUG, PSTR("CFG: Domoticz loaded from file"));
  }
  else {
    // File system not ready: No flash space reserved for file system
    AddLog(LOG_LEVEL_DEBUG_MORE, PSTR("CFG: Domoticz use defaults as file system not ready or key not found"));
  }
#endif  // USE_UFILESYS
}

void DomoticzSettingsSave(void) {
  // Called from FUNC_SAVE_SETTINGS every SaveData second and at restart
#ifdef USE_UFILESYS
  uint32_t crc32 = GetCfgCrc32((uint8_t*)&Domoticz->Settings +4, sizeof(DzSettings_t) -4);  // Skip crc32
  if (crc32 != Domoticz->Settings.crc32) {
    Domoticz->Settings.crc32 = crc32;
    if (DomoticzSaveData()) {
      AddLog(LOG_LEVEL_DEBUG, PSTR("CFG: Domoticz saved to file"));
    } else {
      // File system not ready: No flash space reserved for file system
      AddLog(LOG_LEVEL_DEBUG_MORE, PSTR("CFG: Domoticz ERROR File system not ready or unable to save file"));
    }
  }
#endif  // USE_UFILESYS
}

/*********************************************************************************************/

int DomoticzBatteryQuality(void) {
  // Battery 0%: ESP 2.6V (minimum operating voltage is 2.5)
  // Battery 100%: ESP 3.6V (maximum operating voltage is 3.6)
  // Battery 101% to 200%: ESP over 3.6V (means over maximum operating voltage)

  int quality = 100;	// Voltage range from 2,6V > 0%  to 3,6V > 100%

#ifdef ESP8266
#ifdef USE_ADC_VCC
  uint16_t voltage = ESP.getVcc();
  if (voltage <= 2600) {
    quality = 0;
  } else if (voltage >= 4600) {
    quality = 200;
  } else {
    quality = (voltage - 2600) / 10;
  }
#endif  // USE_ADC_VCC
#endif  // ESP8266
  return quality;
}

int DomoticzRssiQuality(void) {
  // RSSI range: 0% to 10% (12 means disable RSSI in Domoticz)

  return WifiGetRssiAsQuality(WiFi.RSSI()) / 10;
}

uint32_t DomoticzRelayIdx(uint32_t relay) {
  if (relay >= MAX_RELAYS_SET) { return 0; }
  return Domoticz->Settings.relay_idx[relay];
}

void DomoticzSetRelayIdx(uint32_t relay, uint32_t idx) {
  if (relay >= MAX_RELAYS_SET) { return; }
  Domoticz->Settings.relay_idx[relay] = idx;
}

/*********************************************************************************************/

void MqttPublishDomoticzPowerState(uint8_t device) {
  if (Settings->flag.mqtt_enabled) {  // SetOption3 - Enable MQTT
    if (device < 1) { device = 1; }
    if ((device > TasmotaGlobal.devices_present) || (device > MAX_RELAYS_SET)) { return; }
    if (DomoticzRelayIdx(device -1)) {
#ifdef USE_SHUTTER
      if (Domoticz->is_shutter) {
        // Shutter is updated by sensor update - power state should not be sent
      } else {
#endif  // USE_SHUTTER
        char svalue[8];  // Dimmer value

        snprintf_P(svalue, sizeof(svalue), PSTR("%d"), Settings->light_dimmer);
        Response_P(DOMOTICZ_MESSAGE, (int)DomoticzRelayIdx(device -1), (TasmotaGlobal.power & (1 << (device -1))) ? 1 : 0, (TasmotaGlobal.light_type) ? svalue : "", DomoticzBatteryQuality(), DomoticzRssiQuality());
        MqttPublish(domoticz_in_topic);
#ifdef USE_SHUTTER
      }
#endif //USE_SHUTTER
    }
  }
}

void DomoticzUpdatePowerState(uint8_t device) {
  if (Domoticz) {
    if (Domoticz->update_flag) {
      MqttPublishDomoticzPowerState(device);
    }
    Domoticz->update_flag = true;
  }
}

/*********************************************************************************************/

void DomoticzMqttUpdate(void) {
  if (Domoticz->subscribe && (Domoticz->Settings.update_timer || Domoticz->update_timer)) {
    Domoticz->update_timer--;
    if (Domoticz->update_timer <= 0) {
      Domoticz->update_timer = Domoticz->Settings.update_timer;
      for (uint32_t i = 1; i <= TasmotaGlobal.devices_present; i++) {
#ifdef USE_SHUTTER
        if (Domoticz->is_shutter) {
          // no power state updates for shutters
          break;
        }
#endif // USE_SHUTTER
          MqttPublishDomoticzPowerState(i);
      }
    }
  }
}

void DomoticzMqttSubscribe(void) {
  uint8_t maxdev = (TasmotaGlobal.devices_present > MAX_RELAYS_SET) ? MAX_RELAYS_SET : TasmotaGlobal.devices_present;
  bool any_relay = false;
  for (uint32_t i = 0; i < maxdev; i++) {
    if (DomoticzRelayIdx(i)) {
      any_relay = true;
      break;
    }
  }
  char stopic[TOPSZ];
  snprintf_P(stopic, sizeof(stopic), PSTR(DOMOTICZ_OUT_TOPIC "/#"));  // domoticz topic
  if (Domoticz->subscribe && !any_relay) {
    Domoticz->subscribe = false;
    MqttUnsubscribe(stopic);
  }
//  if (!Domoticz->subscribe && any_relay) {  // Fails on MQTT server reconnect
  if (any_relay) {
    Domoticz->subscribe = true;
    MqttSubscribe(stopic);
  }
}

int DomoticzIdx2Relay(uint32_t idx) {
  if (idx > 0) {
    uint32_t maxdev = (TasmotaGlobal.devices_present > MAX_RELAYS_SET) ? MAX_RELAYS_SET : TasmotaGlobal.devices_present;
    for (uint32_t i = 0; i < maxdev; i++) {
      if (idx == DomoticzRelayIdx(i)) {
        return i;
      }
    }
  }
  return -1;  // Idx not mine
}

bool DomoticzMqttData(void) {
/*
  XdrvMailbox.topic = topic;
  XdrvMailbox.index = strlen(topic);
  XdrvMailbox.data = (char*)data;
  XdrvMailbox.data_len = data_len;
*/
  Domoticz->update_flag = true;

  if (!Domoticz->subscribe) { 
    return false;  // No Domoticz driver subscription so try user subscribes
  }

  // Default subscibed to domoticz/out/#
  if (strncasecmp_P(XdrvMailbox.topic, PSTR(DOMOTICZ_OUT_TOPIC), strlen(DOMOTICZ_OUT_TOPIC)) != 0) {
    return false;  // Process unchanged data
  }

  // topic is domoticz/out so check if valid data could be available
  if (XdrvMailbox.data_len < 20) {
    return true;  // No valid data
  }

#ifdef USE_DOMOTICZ_DEBUG
  char dom_data[XdrvMailbox.data_len +1];
  strcpy(dom_data, XdrvMailbox.data);
  AddLog(LOG_LEVEL_DEBUG_MORE, PSTR(D_LOG_DOMOTICZ "%s = %s"), XdrvMailbox.topic, RemoveControlCharacter(dom_data));
#endif  // USE_DOMOTICZ_DEBUG

