arendst/Tasmota/tasmota/tasmota_xdrv_driver/xdrv_07_esp32_domoticz.ino
  // Quick check if this is mine using topic domoticz/out/{$idx}
  if (strlen(XdrvMailbox.topic) > strlen(DOMOTICZ_OUT_TOPIC)) {
    char* topic_index = &XdrvMailbox.topic[strlen(DOMOTICZ_OUT_TOPIC) +1];
    if (strchr(topic_index, '/') == nullptr) {         // Skip if topic ...floor/room
      if (DomoticzIdx2Relay(atoi(topic_index)) < 0) {
        return true;  // Idx not mine
      }
    }
  }

  String domoticz_data = XdrvMailbox.data;  // Copy the string into a new buffer that will be modified
  JsonParser parser((char*)domoticz_data.c_str());
  JsonParserObject domoticz = parser.getRootObject();
  if (!domoticz) {
    return true;  // To much or invalid data
  }
  int32_t relay_index = DomoticzIdx2Relay(domoticz.getUInt(PSTR("idx"), 0));
  if (relay_index < 0) {
    return true;  // Idx not mine
  }
  int32_t nvalue = domoticz.getInt(PSTR("nvalue"), -1);
  if ((nvalue < 0) || (nvalue > 16)) {
    return true;  // Nvalue out of boundaries
  }

  AddLog(LOG_LEVEL_DEBUG_MORE, PSTR(D_LOG_DOMOTICZ "%s, idx %d, nvalue %d"), XdrvMailbox.topic, DomoticzRelayIdx(relay_index), nvalue);

  bool iscolordimmer = (strcmp_P(domoticz.getStr(PSTR("dtype")), PSTR("Color Switch")) == 0);
  bool isShutter = (strcmp_P(domoticz.getStr(PSTR("dtype")), PSTR("Light/Switch")) == 0) && (strncmp_P(domoticz.getStr(PSTR("switchType")),PSTR("Blinds"), 6) == 0);

#ifdef USE_SHUTTER
  if (isShutter) {
    uint32_t position = domoticz.getUInt(PSTR("svalue1"), 0);
    if (nvalue != 2) {
      position = (0 == nvalue) ? 0 : 100;
    }
    snprintf_P(XdrvMailbox.topic, TOPSZ, PSTR("/" D_PRFX_SHUTTER D_CMND_SHUTTER_POSITION));
    snprintf_P(XdrvMailbox.data, XdrvMailbox.data_len, PSTR("%d"), position);
    XdrvMailbox.data_len = position > 99 ? 3 : (position > 9 ? 2 : 1);
  } else
#endif // USE_SHUTTER
#ifdef USE_LIGHT
  if (iscolordimmer && 10 == nvalue) {  // Color_SetColor
    // https://www.domoticz.com/wiki/Domoticz_API/JSON_URL%27s#Set_a_light_to_a_certain_color_or_color_temperature
    JsonParserObject color = domoticz[PSTR("Color")].getObject();
    // JsonObject& color = domoticz["Color"];
    uint32_t level = nvalue = domoticz.getUInt(PSTR("svalue1"), 0);
    uint32_t r = color.getUInt(PSTR("r"), 0) * level / 100;
    uint32_t g = color.getUInt(PSTR("g"), 0) * level / 100;
    uint32_t b = color.getUInt(PSTR("b"), 0) * level / 100;
    uint32_t cw = color.getUInt(PSTR("cw"), 0) * level / 100;
    uint32_t ww = color.getUInt(PSTR("ww"), 0) * level / 100;
    uint32_t m = color.getUInt(PSTR("m"), 0);
    uint32_t t = color.getUInt(PSTR("t"), 0);
    if (2 == m) {  // White with color temperature. Valid fields: t
      snprintf_P(XdrvMailbox.topic, XdrvMailbox.index, PSTR("/" D_CMND_BACKLOG));
      snprintf_P(XdrvMailbox.data, XdrvMailbox.data_len, PSTR(D_CMND_COLORTEMPERATURE " %d;" D_CMND_DIMMER " %d"), changeUIntScale(t, 0, 255, CT_MIN, CT_MAX), level);
    } else {
      snprintf_P(XdrvMailbox.topic, XdrvMailbox.index, PSTR("/" D_CMND_COLOR));
      snprintf_P(XdrvMailbox.data, XdrvMailbox.data_len, PSTR("%02x%02x%02x%02x%02x"), r, g, b, cw, ww);
    }
  }
  else if ((!iscolordimmer && 2 == nvalue) ||  // gswitch_sSetLevel
            (iscolordimmer && 15 == nvalue)) {  // Color_SetBrightnessLevel
    if (domoticz[PSTR("svalue1")]) {
      nvalue = domoticz.getUInt(PSTR("svalue1"), 0);
    } else {
      return true;  // Invalid data
    }
    if (TasmotaGlobal.light_type && (Settings->light_dimmer == nvalue) && ((TasmotaGlobal.power >> relay_index) &1)) {
      return true;  // State already set
    }
    snprintf_P(XdrvMailbox.topic, XdrvMailbox.index, PSTR("/" D_CMND_DIMMER));
    snprintf_P(XdrvMailbox.data, XdrvMailbox.data_len, PSTR("%d"), nvalue);
  } else
#endif  // USE_LIGHT
  if (1 == nvalue || 0 == nvalue) {
    if (((TasmotaGlobal.power >> relay_index) &1) == (power_t)nvalue) {
      return true;  // Stop loop
    }
    char stemp1[10];
    snprintf_P(XdrvMailbox.topic, XdrvMailbox.index, PSTR("/" D_CMND_POWER "%s"), (TasmotaGlobal.devices_present > 1) ? itoa(relay_index +1, stemp1, 10) : "");
    snprintf_P(XdrvMailbox.data, XdrvMailbox.data_len, PSTR("%d"), nvalue);
  } else {
    return true;    // No command received
  }

  AddLog(LOG_LEVEL_DEBUG_MORE, PSTR(D_LOG_DOMOTICZ D_RECEIVED_TOPIC " %s, " D_DATA " %s"), XdrvMailbox.topic, XdrvMailbox.data);

  Domoticz->update_flag = false;
  return false;    // Process new data
}

/*********************************************************************************************/

void DomoticzSendSwitch(uint32_t type, uint32_t index, uint32_t state) {
  char stemp[16];  // "switchlight" or "switchscene"
  Response_P(PSTR("{\"command\":\"%s\",\"idx\":%d,\"switchcmd\":\"%s\"}"),
    GetTextIndexed(stemp, sizeof(stemp), type, kDomoticzCommand), index, (state) ? (POWER_TOGGLE == state) ? "Toggle" : "On" : "Off");  // Domoticz case sensitive
  MqttPublish(domoticz_in_topic);
}

bool DomoticzSendKey(uint8_t key, uint8_t device, uint8_t state, uint8_t svalflg) {
  bool result = false;

  if (device <= MAX_RELAYS_SET) {
    if ((Domoticz->Settings.key_idx[device -1] || Domoticz->Settings.switch_idx[device -1]) && (svalflg)) {
      DomoticzSendSwitch(0, (key) ? Domoticz->Settings.switch_idx[device -1] : Domoticz->Settings.key_idx[device -1], state);
      result = true;
    }
  }
  return result;
}

/*********************************************************************************************\
 * Sensors
 *
 * Source : https://www.domoticz.com/wiki/Domoticz_API/JSON_URL%27s
 *          https://www.domoticz.com/wiki/MQTT
 *
 * Percentage, Barometric, Air Quality:
 * {\"idx\":%d,\"nvalue\":%s}, Idx, Value
 *
 * Humidity:
 * {\"idx\":%d,\"nvalue\":%s,\"svalue\":\"%s\"}, Idx, Humidity, HumidityStatus
 *
 * All other:
 * {\"idx\":%d,\"nvalue\":0,\"svalue\":\"%s\"}, Idx, Value(s)
 *
\*********************************************************************************************/

void DomoticzSendData(uint32_t sensor_idx, uint32_t idx, char *data) {
  char payload[128];  // {"idx":26700,"nvalue":0,"svalue":"22330.1;10234.4;22000.5;10243.4;1006;3000","Battery":100,"RSSI":10}
  if (DZ_AIRQUALITY == sensor_idx) {
    snprintf_P(payload, sizeof(payload), PSTR("{\"idx\":%d,\"nvalue\":%s,\"Battery\":%d,\"RSSI\":%d}"),
      idx, data, DomoticzBatteryQuality(), DomoticzRssiQuality());
  } else {
    uint8_t nvalue = 0;
#ifdef USE_SHUTTER
    if (DZ_SHUTTER == sensor_idx) {
      uint8_t position = atoi(data);
      nvalue = position < 2 ? 0 : (position == 100 ? 1 : 2);
    }
#endif  // USE_SHUTTER
    snprintf_P(payload, sizeof(payload), DOMOTICZ_MESSAGE,  // "{\"idx\":%d,\"nvalue\":%d,\"svalue\":\"%s\",\"Battery\":%d,\"RSSI\":%d}"
      idx, nvalue, data, DomoticzBatteryQuality(), DomoticzRssiQuality());
  }
  MqttPublishPayload(domoticz_in_topic, payload);
}

void DomoticzSensor(uint8_t idx, char *data) {
  if (Domoticz->Settings.sensor_idx[idx]) {
    DomoticzSendData(idx, Domoticz->Settings.sensor_idx[idx], data);
  }
}

uint8_t DomoticzHumidityState(float h) {
  return (!h) ? 0 : (h < 40) ? 2 : (h > 70) ? 3 : 1;
}

void DomoticzSensor(uint8_t idx, int value) {
  char data[16];
  snprintf_P(data, sizeof(data), PSTR("%d"), value);
  DomoticzSensor(idx, data);
}

void DomoticzFloatSensor(uint8_t idx, float value) {
  uint32_t resolution = 1;
/*
  switch (idx) {
    case DZ_TEMP: resolution = Settings->flag2.temperature_resolution; break;
    case DZ_POWER_ENERGY: resolution = Settings->flag2.wattage_resolution; break;
    case DZ_VOLTAGE: resolution = Settings->flag2.voltage_resolution; break;
    case DZ_CURRENT: resolution = Settings->flag2.current_resolution; break;
  }
*/
  if (DZ_TEMP == idx) { resolution = Settings->flag2.temperature_resolution; }
  else if (DZ_POWER_ENERGY == idx) { resolution = Settings->flag2.wattage_resolution; }
  else if (DZ_VOLTAGE == idx) { resolution = Settings->flag2.voltage_resolution; }
  else if (DZ_CURRENT == idx) { resolution = Settings->flag2.current_resolution; }
  char data[FLOATSZ];
  dtostrfd(value, resolution, data);
  DomoticzSensor(idx, data);
}

//void DomoticzTempHumPressureSensor(float temp, float hum, float baro = -1);
void DomoticzTempHumPressureSensor(float temp, float hum, float baro) {
  char temperature[FLOATSZ];
  dtostrfd(temp, Settings->flag2.temperature_resolution, temperature);
  char humidity[FLOATSZ];
  dtostrfd(hum, Settings->flag2.humidity_resolution, humidity);

  char data[32];
  if (baro > -1) {
    char pressure[FLOATSZ];
    dtostrfd(baro, Settings->flag2.pressure_resolution, pressure);

